/*Задача 62
Конвертация дат с разбиением

Дана следующая структура:
{
    '2019-12-31': 1,
    '2019-12-30': 2,
    '2019-12-29': 3,
    '2019-11-28': 4,
    '2019-11-27': 5,
    '2018-12-31': 6,
    '2018-12-32': 7,
}

Напишите код, которой переделает структуру данных вот в такую:
{
    2019: {
    12: {
        31: 1,
            30: 2,
            29: 3,
    },
    11: {
        28: 4,
            27: 5,
    }
},
    2018: {
    12: {
        31: 6,
            30: 7,
    },
}
}

 */

const data = {
    '2019-12-31': 1,
    '2019-12-30': 2,
    '2019-12-29': 3,
    '2019-11-28': 4,
    '2019-11-27': 5,
    '2018-12-31': 6,
    '2018-12-32': 7,
}

let temp = {}
for (const dataKey in data) {
    let splitData = dataKey.split("-");
    //Деструктурирующее присваивание
    let [year, month, day] = splitData;
    //Операторы нулевого слияния и присваивания: '??', '??='
    temp[year] ??= {};
    temp[year][month] ??= {};
    temp[year][month][day] = data[dataKey];
}
console.log(temp)